app/Http/Controllers/CatalogController.php

    public function index()
    {
        $catalogs = Catalog::select(['id', 'name', 'description', 'price', 'image'])->latest()->get();
---
select `id`, `name`, `description`, `price`, `image` from `catalogs` order by `created_at` desc

    public function edit(string $id)
    {
        $id = Crypt::decryptString($id);
        $catalog = Catalog::find($id);
        $categories = Category::all();
---
select * from `catalogs` where `catalogs`.`id` = '2' limit 1
select * from `categories`

    public function update(Request $request, string $id)
    {
        $validated = $request->validate([
            'name' => 'required',
            'price' => 'required|integer',
            'description' => 'required',
            'image' => 'image|mimes:jpeg,png,jpg|max:2048',
            'category_id' => 'required',
        ]);
        $id = Crypt::decryptString($id);
        $table = Catalog::find($id);
        if(empty($request->file('image'))){
            $image = $table->image;
        }else{
        $image = $this->updateImage('images/catalogs/', $table->image, $request->file('image'));
---
select * from `catalogs` where `catalogs`.`id` = '2' limit 1
update `catalogs` set `image` = '202503031309250f942e077dc56a2d0318d3bf16dcc720a2add9d1.webp', `catalogs`.`updated_at` = '2025-03-03 13:09:27' where `id` = 2

    public function destroy(string $id)
    {
        $id = Crypt::decryptString($id);
        $catalog = Catalog::find($id);
        $this->destroyImage('images/catalogs/', $catalog->image);
        $catalog->delete();
---
select * from `catalogs` where `catalogs`.`id` = '1' limit 1
delete from `catalogs` where `id` = 1