app/Http/Controllers/CategoryController.php

    public function index()
    {
        $categories = Category::select(['title', 'id'])->latest()->get();
---
select `title`, `id` from `categories`