app/Http/Controllers/GalleryController.php

select * from `galleries` order by `created_at` desc
---
    public function index()
    {
        $galleries = Gallery::latest()->get();