app/Http/Controllers/NewsController.php

select * from `news` order by `created_at` desc
---
    public function index()
    {
        $news = News::latest()->get();